[
    {
        "location_name": "1. Explore Melbourne’s Street Art",
        "description": "Melbourne is deservedly world famous for its street art. And spending a few hours exploring it on foot is actually a fabulous activity to do with your pup. Unlike art galleries, there’s no rules against pets walking down laneways!"
    },
    {
        "location_name": "2. Go Hiking in the You Yangs",
        "description": "If you’d prefer a walk amongst nature rather than gritty alleyways, one of the best destinations to head to just outside of Melbourne is theYou Yangs Regional Park. Located less than an hour from the centre of Melbourne, this regional park welcomes dogs to join you, as long as they stay on a leash."
    },
    {
        "location_name": "3. Enjoy a Pugichino and Treats at Miss Drew’s",
        "description": "A cute destination to visit on a weekend day trip from Melbourne, that your pup will simply love, isMiss Drew’s Bakery and Dog Cafeon the Mornington Peninsula. Located behind the Tyabb Packing House and surrounded by antique shops, the dog cafe is open on Saturdays and Sundays. (It’s best to double check the opening hours in advance.)"
    },
    {
        "location_name": "4. Spend the Day at St Kilda",
        "description": "St Kilda has long been a popular day trip destination in Melbourne, and it’s also a terrific destination to visit with your pup. While your dog won’t be allowed on the rides at Luna Park amusement park, instead take a walk along the pier (where dogs are allowed on a leash) and enjoy the surrounding beaches."
    },
    {
        "location_name": "5. Enjoy Paddle & Brunch at St Kilda",
        "description": "Chez Misty isn’t just a dog-friendly creperie, they also offerPaddle and Brunch eventsfor adventurous pups. You’ll first of all enjoy a 1-hour Stand Up Paddleboard session with your pup, then breakfast together back at Chez Misty."
    },
    {
        "location_name": "6. Go Punting in the Botanic Gardens",
        "description": "A wonderful dog-friendly destination in the centre of Melbourne are the Royal Botanic Gardens Victoria – Melbourne Gardens. Leashed dogs are welcome to join you for a stroll around the gardens, whether around the ornamental lake, through the fern gully or past the “volcano”."
    },
    {
        "location_name": "7. Head to Altona Dog Beach",
        "description": "Another popular dog-friendly beach in Melbourne isAltona Dog Beach, just west of the city and Williamstown."
    },
    {
        "location_name": "8. Explore Yarra Bend Park",
        "description": "Yarra Bend Park is only 4km northeast of Melbourne’s CBD, but is home to the largest area of natural bushland left in the inner suburbs of Melbourne. The park is situated on both banks of the Yarra River, which takes a meandering 12km path through the park."
    },
    {
        "location_name": "9. Stroll Around Lake Daylesford",
        "description": "Daylesford is a popular weekend destination from Melbourne, but it’s also close enough for a day trip, with the drive from the centre of Melbourne taking about 80 minutes. Renowned for its mineral springs and fine dining, the top dog-friendly activity in Daylesford is taking a stroll around Lake Daylesford."
    },
    {
        "location_name": "10. Enjoy High Tea in Olinda",
        "description": "A gorgeous spot in the Dandenong Ranges is theOlinda Tea House. Situated high in the ranges, this architecturally stunning tea house serves up delightful high teas, and not just for humans."
    },
    {
        "location_name": "11. Go Picnicking at Hanging Rock",
        "description": "Just over an hour north of Melbourne isHanging Rock, made famous by the novel and subsequent film, “Picnic at Hanging Rock”."
    },
    {
        "location_name": "12. Or Climb to Camel’s Hump",
        "description": "Another park with dog-friendly walking trails close to Hanging Rock is theMacedon Regional Park, situated just to the south and containing the forested heights of the Macedon Ranges. There’s a wide variety of walking trails in the park, from the 200m stroll to Memorial Cross from next to the tea rooms to the 30km loop track that links all the major sites in the park."
    },
    {
        "location_name": "13. Ride an Historic Train",
        "description": "There’s multiple historic train rides located not that far from Melbourne where you can enjoy a ride with your dog."
    },
    {
        "location_name": "14. Go Underground at Walhalla",
        "description": "While Walhalla is closer to 2.5 hours drive from the centre of Melbourne, like I mentioned above, it’s well worth the slightly longer road trip, as the historic train rides aren’t the only dog-friendly attraction in this historic gold mining town."
    },
    {
        "location_name": "15. Visit McClelland’s Sculpture Park",
        "description": "For an arty dog-friendly experience on the edge of Melbourne, head toMcClelland’s Sculpture Parknear Frankston. While dogs are not allowed inside the galleries also located on the site, leashed dogs are welcome to join you for a stroll around the sculpture park."
    },
    {
        "location_name": "16. Go Leash-Free at the Briars Community Forest",
        "description": "If you keep on driving past Frankston, you’ll arrive at the Mornington Peninsula proper. While I didn’t find this popular weekend destination on the edge of Melbourne that dog-friendly (most of the beaches don’t allow dogs, especially during summer), it is home to a superb off-leash dog park."
    },
    {
        "location_name": "17. Stroll Along the Geelong Foreshore",
        "description": "It’s an easy 80-minute drive the opposite direction from Melbourne to Geelong. WhileGeelongis often overlooked in favour of the Great Ocean Road that starts just past it, it is home to a beautiful waterfront that makes for a great dog-friendly stroll."
    },
    {
        "location_name": "18. Head to Fisherman’s Beach in Torquay",
        "description": "While leashed dogs are allowed on Eastern Beach in Geelong all year round, during much of the year it’s worthwhile driving a little further past Geelong to Fishermans Beach in Torquay, for a fabulous beach day trip with your dog."
    },
    {
        "location_name": "19. Visit Forest Glade Gardens",
        "description": "During the Autumn months, Mount Macedon is a popular destination for viewing its colourful Autumn leaves and enjoying its cooler climate. However, Mount Macedon is also worthwhile to visit anytime of year with your dog, thanks to the dog-friendlyForest Glade Gardens."
    },
    {
        "location_name": "20. Hike to Toorongo and Amphitheatre Falls",
        "description": "About a two-hour drive east of Melbourne is the Toorongo Falls Reserve at Noojee. While dogs aren’t allowed in the Yarra Ranges National Park to the north, dogs are allowed at Tooroongo Falls Reserve (including off-leash, as long as they are under effective control)."
    },
    {
        "location_name": "21. Go Wine Tasting in the Yarra Valley",
        "description": "There’s multiple superb wine regions on the doorstep of Melbourne, but one of the best and the most dog-friendly is the Yarra Valley, the oldest wine region in Victoria."
    },
    {
        "location_name": "22. Or Take a Dog-Friendly Winery Bus Tour",
        "description": "Another option for a dog-friendly day tour where you don’t need to drive are theGourmet Pawprints Tourson Bella the Dog Welcoming Bus."
    },
    {
        "location_name": "23. Explore the Ruins of Maldon",
        "description": "It’s an easy 1hr 40 minute drive from central Melbourne to the former gold mining village of Maldon. Australia’s First Notable Town, after being classified by the National Trust in 1966, it’s a great destination for a dog-friendly day trip."
    },
    {
        "location_name": "24. Visit a Former Gold Mine in Bendigo",
        "description": "Maldon isn’t the only dog-friendly gold mining town in central Victoria, with the city of Bendigo a superb dog-friendly destination and under 2 hours drive from Melbourne. Along with the dog-friendly Vintage Talking Trams, one of the highlights of a visit to Bendigo is visiting theCentral Deborah Gold Mine."
    },
    {
        "location_name": "25. Explore the Western World’s Largest Stupa",
        "description": "The sights of Bendigo aren’t limited to gold mining ruins. One of the most surprising attractions just outside of town is theGreat Stupa of Universal Compassion, the largest stupa in the Western World."
    },
    {
        "location_name": "26. Enjoy a Cruise on the Yarra",
        "description": "To view Melbourne from a different viewpoint, take a relaxing cruise along the Yarra River. And you don’t need to leave your dog behind, with Melbourne River Cruises permitting dogs on board their publicYarra River Cruises. (Note that dogs aren’t permitted on other cruises, including dinner and special event cruises.)"
    },
    {
        "location_name": "27. Or Hire Your Own Boat",
        "description": "If you’d prefer to drive your own boat in Melbourne with your dog on-board consider hiring one of the pet-friendly picnic boats fromGoBoat."
    },
    {
        "location_name": "28. Visit an Historic Botanic Garden",
        "description": "In the latest 19th century, it became the fashion that any well-to-do town in Victoria would have their own botanic garden, both for the propagation of European plant species and a place for locals to spend their leisure time. Many of these are still wonderfully-maintained, and also welcome leashed dogs to join you."
    },
    {
        "location_name": "29. Hike the George Bass Coastal Walk",
        "description": "For a scenic dog-friendly walking track along the coast, head just over 90 minutes southeast of Melbourne to the George Bass Coastal Walk, located nearPhillip Island."
    },
    {
        "location_name": "30. Watch a Movie by Moonlight",
        "description": "Every year, theMoonlight Cinemasets up its screen at the Royal Botanic Gardens in Melbourne. And if you have a well-behaved pooch who can stay quiet while watching a movie, they’re welcome to join you on your picnic rug. Dogs are welcome in all sections, including premium areas."
    },
    {
        "location_name": "31. Go on a Puppy Pub Crawl",
        "description": "Melbourne is home to plenty of dog-friendly pubs, so why not take your pup on a pub crawl?Puppy Pub Crawlorganises group pub crawls for dogs and their owners, visiting some of the best pet-friendly establishments around Melbourne. The pub crawls are also a great opportunity to socialise, both for the pups and the humans."
    },
    {
        "location_name": "32. Chill at a Beach Club",
        "description": "During the long days of summer, a hip place to hang out with your pup is atWest Beach Pavilionat St Kilda West Beach. Dogs are allowed on this stretch of sand all day long, but why just laze on the sand when you can rent a sun lounge at the beach club?"
    },
    {
        "location_name": "You May Also Like",
        "description": "No description available."
    },
    {
        "location_name": "About the Author",
        "description": "No description available."
    }
]