[
    {
        "name": "Eades Park Fenced Dog Park",
        "description": "Fenced dog park offering secure play areas, hydration station, and evening lights at the West Melbourne Dog Park, Eades Park.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Moray Street Reserve Fenced Dog Park",
        "description": "Discover Moray Street Reserve Fenced Dog Park in Southbank, Melbourne – a convenient, compact space for urban dogs to run and play off-leash.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Ron Barassi Snr Off-Leash Park",
        "description": "A sceneic off-leash park in Melbourne Docklands for your dog to explore, with water stations, seating, and BBQ areas at Ron Barassi Snr Park.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Scovell Reserve Off-Leash Park",
        "description": "A welcoming off-leash park in Maidstone, ideal for dog owners. Enjoy BBQs, sports fields, and family-friendly areas for a perfect day out.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Martin Reserve Fenced Dog Park",
        "description": "A local favourite fenced dog park in Melbourne. Featuring high fences, double gates, and varied terrains, it’s a local favourite. Enjoy shade, social spots, and a community-shared toy stash.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Hansen Reserve Dog Off Leash Area",
        "description": "Off-leash dog park in West Footscray. Expansive open spaces for dogs to unleash their energy. Tree-lined perimeters for shade. Peaceful weekdays and lively weekends await!",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Barbara Beyer Reserve Off Leash Area",
        "description": "Discover a vibrant community hub for dogs to play freely in the off-leash area at Yarraville Gardens, Barbara Beyer Reserve.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "McIvor Reserve Fenced Dog Park",
        "description": "Discover a fenced dog park in Yarraville. It offers grassy open spaces, ample shade from trees, and an intriguing rocky mound for dogs. Experience the area’s friendly atmosphere and grab a coffee nearby.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "The Warmies Dog Off Leash Area – Newport Riverside Park",
        "description": "Ample space and unique views, the Warmies dog off-leash area in Newport is a great place for your dog to play and explore near Williamstown.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Riverside Fenced Dog Park",
        "description": "Visit Riverside, a fenced dog park in Spotswood with 45,000 sqm of off-leash area, popular among larger dog breeds for outdoor fun.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Gloucester Reserve Dog Off-Leash Area",
        "description": "A serene Williamstown off-leash park, boasts 12,000 sq meters for dogs to roam. Its location on Hobsons Bay Coastal Trail and mesmerising bay sunsets make it a favourite among locals.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Cyril Curtain Reserve Dog Off-Leash Area",
        "description": "A serene off-leash paradise with panoramic bay views and tranquil surroundings. Perfect for dog lovers and those seeking a peaceful escape by the bay.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Doug Grant Reserve Fenced Dog Park",
        "description": "A standout fenced dog park in Altona. Covering 115,000 sqm, it promises ample space for playful pups. Situated by Hobsons Bay Coastal Trail, it’s a favourite for dog-lovers seeking both community and serenity.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Altona Dog Beach",
        "description": "One of the best dog beaches in Melbourne, Altona’s beach offers shallow waters that come alive at low tide. With breathtaking sunset views, it’s the place for memorable outings with your pooch.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "P A Burns Reserve Fenced Dog Park",
        "description": "Featuring a unique dual-section design, it offers flexibility for both maintenance and dog play. Easily connected to Hobsons Bay Coastal Trail and Altona dog beach, it’s the ultimate play spot for every pup.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Wahgunyah Reserve Fenced Dog Park",
        "description": "A peaceful dog park in St Albans. Visit Wahgunyah Reserve fenced dog park for a fun and secure experience for your dog.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Kevin Flint Memorial Reserve Dog Park",
        "description": "Fenced dog park in Cairnlea with separate areas for big & small dogs, sandpits & more at the Kevin Flint Memorial Reserve Dog Park.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Thompson Reserve Off-Leash & Dog Agility Park",
        "description": "Maribyrnong’s top off-leash park offers engaging agility challenges, art-infused landscapes, and picturesque walks for dogs and owners.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Fairbairn Park Off-Leash Park",
        "description": "Huge 100,000 sqm off-leash park in Ascot Vale with open spaces, native flora, and facilities along Maribyrnong River Trail – A dog’s playground at Fairbairn Park!",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Chifley Drive Reserve Dog Off-Leash Park",
        "description": "Explore the wide-open space and essential amenities at the favourite Off-Leash Park in Maribyrnong, Chifley Drive Reserve Dog Park.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "J.H. Allan Reserve Off-Leash Area",
        "description": "Enjoy a local favourite off-leash park in Keilor East with amenities and grassy areas for your dog at J.H. Allan Reserve.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Thompson Reserve Dog Off-Leash Park",
        "description": "Escape to a quiet bushland paradise. Thompson Reserve off-leash park in Avondale Heights offers lush green spaces for your pup to run free.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Green Gully Reserve Fenced Dog Park",
        "description": "Separate areas for big & small dogs, agility course, and varied terrain. Green Gully Reserve, a fenced dog park in Keilor, is full of top amenities.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Cliff Whitworth Reserve Fenced Dog Park",
        "description": "Hilltop views, agility course, fully fenced areas for big & small dogs, water fountains & more. Compact Cliff Whitworth Reserve Fenced Dog Park in Essendon West.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Aberfeldie Park Dog Off-Leash Area",
        "description": "A lively off-leash park in Aberfeldie with dog-friendly community vibes and river walks. Perfect for active dogs at Aberfeldie Park.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Alf Pearce Reserve Fenced Dog Park",
        "description": "A sensory playground with dedicated areas for large & small pups, agility zone, and amenities like water fountains – the Alf Pearce Reserve fenced dog park in Strathmore.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Clayton Reserve Dog Park",
        "description": "Community vibes and secure, off-leash fun at Clayton Reserve, a top dog park in North Melbourne with dog-friendly amenities.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Royal Park Dog Off-Leash Area",
        "description": "Royal Park’s dog off-leash area in Parkville. Tranquil and expansive park, with easy trails for the ultimate dog-friendly outdoor experience.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Curtain Square Fenced Dog Park",
        "description": "A relaxed, gravel-covered dog play area with shaded seating for owners at Curtain Square fenced dog park in Carlton North.",
        "location": "Fenced Dog Park"
    },
    {
        "name": "Gilpin Park Fenced Dog Park and Off-Leash Area",
        "description": "A large expansive off-leash park, with a fenced dog park section, and shaded seating. Popular and friendly, it’s perfect for both spirited play and relaxed strolls with your furry friend.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "A G Gillon Oval Dog Off-Leash Park",
        "description": "Discover the top dog off-leash park in Brunswick, bordering Brunswick West. A pristine parkland where friendly locals and happy dogs converge, especially when the sports ground is free.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Victoria Park Fenced Dog Off-Leash Area",
        "description": "Historic Victoria Park in Abbotsford offers off-leash fun, evening lights, BBQs, and easy access for dog-lovers and their pets. Convenient parking and transport available.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Darling Gardens Off-Leash Area",
        "description": "A spacious off-leash area in Clifton Hill with scenic paths and amenities. Darling Gardens offers a fun day out with your dog.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Quarries Park & Ramsden Street Reserve Off-Leash Areas",
        "description": "A vast, dog-friendly sanctuary offering off-leash fun, excellent facilities, and a welcoming community in the heart of Clifton Hill.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Thomas Oval Fenced Dog Park, Como Park",
        "description": "Explore Thomas Oval Dog Park in South Yarra – a unique, fenced dog park with zones catering to dogs of all sizes and energy levels. Enjoy the sandpit, scenic surrounds, and nearby amenities for a fun-filled day with your furry friend.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Fawkner Park Off-Leash Area",
        "description": "Discover the ultimate dog-walking paradise at Fawkner Park, South Yarra. With vast off-leash areas, tranquil spots for picnics, and a range of facilities, it’s a dog lover’s dream come true. You and your furry friend will have a tail-wagging time!",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Armadale Reserve Off-Leash Park",
        "description": "A simple off-leash park with convenient amenities, peaceful surroundings, and a great choice for locals at Armadale Reserve Off-Leash Park.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Malvern Cricket Ground Off-Leash Park",
        "description": "Explore a mostly fenced, quiet off-leash area with basic amenities and rich history. Perfect for local dog owners at Malvern Cricket Ground.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Ardie Park Off-Leash Areas",
        "description": "Discover the dog-friendly amenities, off-leash areas, and serene walking paths at Ardie Park in Malvern East, perfect for a day out.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Malvern Central Park Off Leash Area",
        "description": "Discover a spacious off-leash park in Malvern East perfect for active dogs. Central Park offers ample space, dog amenities, and historical charm.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Waverley Oval Off-Leash Areas",
        "description": "Quiet on weekdays but busy with football games on weekends, with basic amenities and nearby traffic noise at Waverley Oval Malvern East",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Caulfield Park Dog Off Leash Area",
        "description": "Explore the spacious off-leash park in Caulfield with lush greenery, dog-friendly facilities, and family amenities for a perfect day out.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Caulfield Racecourse Reserve Fenced Dog Park",
        "description": "Enjoy off-leash fun, picnics, BBQs, and markets with your dog at Caulfield Racecourse Reserve, the local loved dog park in Caulfield East.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Sydare Reserve Dog Off-Leash Park",
        "description": "A peaceful, simple off-leash area perfect for local dog owners in Malvern East, located at Sydare Reserve.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Pawfield Wedge Fenced Dog Park & Agility Area",
        "description": "Visit Pawfield Park in Caulfield for a safe, fun, and fenced dog park experience. With separate areas for small dogs and agility equipment.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Bailey Reserve Off-Leash Area",
        "description": "Spacious and simple oval, water stations & dog bag stations at Bailey Reserve off-leash park in Bentleigh East.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Victoria Gardens Dog Off Leash Area",
        "description": "An inviting off-leash oval, shaded benches, and pristine gardens make this a favourite spot for dog owners to relax and watch their pets play.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Princes Gardens Off-Leash Park",
        "description": "Off-leash park in Prahran offers shaded seating, dog water stations, and a grassy bowl for play. Princess Gardens popular urban park for dogs.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Lumley Gardens Off-Leash Park",
        "description": "Discover a local spot for your pup to roam free with ample amenities in Prahran at Lumley Gardens Off-Leash Park.",
        "location": "Off-Leash Areas"
    },
    {
        "name": "Peanut Farm Reserve Dog Off-Leash Area",
        "description": "Discover St Kilda’s hidden gem, where dogs roam free and the community thrives. With markets, meet-ups, and muddy adventures, it’s an off-leash haven awaiting your visit!",
        "location": "Off-Leash Areas"
    }
]